10/data/attachments/2d7bf18697b7eaf4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_36349043-2038-4cee-871b-acfc033fc699</nif:username>
            <nif:friendToBeAdded>Joyce_lay_Friend_61529_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>